{
    "id": "AANobbMI",
    "slug": "sodium",
    "project_type": "mod",
    "team": "4reLOAKe",
    "title": "Sodium",
    "description": "Modern rendering engine and client-side optimization mod for Minecraft",
    "body": "![Sodium 0.4 Comparison](https://i.imgur.com/TzLurlG.png)\n\nSodium is a **free and open-source** rendering engine replacement for the Minecraft client which greatly improves frame rates and stuttering while fixing many graphical issues. It boasts wide compatibility with the Fabric mod ecosystem when compared to other mods, and it does so without compromising on how the game looks, giving you that authentic block game feel.\n\n## 📥 Installation guide\n\nMake sure you have the latest version of [Fabric Loader](https://fabricmc.net/use/) installed. Afterwards, all you need to do is simply drop the mod into your mods folder. No other mods or downloads are required in order to use Sodium. You do not need to create new worlds in order to take advantage of the mod.\n\nNot sure if you installed the mod correctly? Try checking your _Video Settings_ screen in Minecraft, which should show our new and improved user interface for changing settings.\n\nOut of the box, Sodium will enable all optimizations which are supported on your system, meaning no additional configuration is needed. You should generally only change video settings related to performance and other advanced features if you are experiencing issues.\n\n➡️ **Note:** By design, Sodium only optimizes the client rendering code. You should also install our other mods, such as [Lithium](https://modrinth.com/mod/lithium) and [Phosphor](https://modrinth.com/mod/phosphor), to optimize the other parts of your game. This is done so that players can pick and choose which mods they want to use, but we generally recommend using [our entire collection](https://modrinth.com/user/jellysquid3).\n\n## 🔥 Performance\n\nThe following performance comparisons have been contributed by our community, and show how Sodium can improve frame rates for a wide range of computers, whether fast or slow. Many of our players report a **250% to 500% increase** in average frame rates.\n\n- AMD Ryzen 5 2600 / AMD Radeon RX 580 ([before](https://cdn.discordapp.com/attachments/948635624729112596/949043152138956850/2022-03-03_21.34.58.png) 88 fps, [after](https://cdn.discordapp.com/attachments/948635624729112596/949043152810041384/2022-03-03_21.36.59.png) 418 fps)\n- Intel Core i3-6100U / Intel HD Graphics 520 ([before](https://cdn.discordapp.com/attachments/948635624729112596/948649845651025930/2022-03-02_13.31.51.png) 17 fps, [after](https://cdn.discordapp.com/attachments/948635624729112596/948649845961396294/2022-03-02_13.24.50.png) 73 fps)\n- AMD Ryzen 7 3700X / NVIDIA RTX 3080 ([before](https://cdn.discordapp.com/attachments/948635624729112596/948678492634120292/2022-03-02_21.28.37.png) 61 fps, [after](https://cdn.discordapp.com/attachments/948635624729112596/948678830430769182/2022-03-02_21.26.02.png) 251 fps)\n- AMD Ryzen 3 3200G / AMD Vega 8 Graphics ([before](https://cdn.discordapp.com/attachments/948635624729112596/948659691125350410/2022-03-02_19.13.34.png) 58 fps, [after](https://cdn.discordapp.com/attachments/948635624729112596/948659690802380840/2022-03-02_19.10.59.png) 173 fps)\n- Intel Core i5-3330 / NVIDIA GeForce GT 1030 ([before](https://cdn.discordapp.com/attachments/948635624729112596/948704894758580284/2022-03-02_23.13.44.png) 36 fps, [after](https://cdn.discordapp.com/attachments/948635624729112596/948704895362551879/2022-03-02_23.03.29.png) 89 fps) \n- Intel Core i7-10700K / NVIDIA GTX 1660 SUPER ([before](https://cdn.discordapp.com/attachments/948635624729112596/948645822730489906/2022-03-02_19.16.28.png) 81 fps, [after](https://cdn.discordapp.com/attachments/948635624729112596/948645834067689483/2022-03-02_19.18.16.png) 256 fps)\n- Intel Core i7-1165G7 / NVIDIA GeForce MX450 ([before](https://cdn.discordapp.com/attachments/948635624729112596/948643441926086746/2022-03-02_13.09.37.png) 45 fps, [after](https://cdn.discordapp.com/attachments/948635624729112596/948643441305333800/2022-03-02_13.04.25.png) 156 fps)\n\nEven for very slow or unusual machines, people often report significant improvements.\n\n- AMD Athlon II M300 / ATI Mobility Radeon HD 4500/5100 ([before](https://cdn.discordapp.com/attachments/948635624729112596/948660512244244490/2022-03-03_00.00.28.png) 9 fps, [after](https://cdn.discordapp.com/attachments/948635624729112596/948660512487518318/2022-03-03_00.12.49.png) 47 fps)\n- Nintendo Switch / ARMv8 Quad-Core CPU / NVIDIA Tegra X1 ([before](https://cdn.discordapp.com/attachments/948635624729112596/949130022797586452/2022-03-03_21.19.39.png) 37 fps, [after](https://cdn.discordapp.com/attachments/948635624729112596/949130039285383208/2022-03-03_21.11.34.png) 108 fps)\n\n## ✅ Compatibility\n\nSodium is mostly stable at this point, but it does not yet contain support for the Fabric Rendering API, which a small number of mods currently use. If you try to use these mods with Sodium, your game may crash or behave unexpectedly.\n\nWe try to ensure compatibility with most graphics cards that have up-to-date drivers for OpenGL 4.6 Core, which covers most graphics cards released after mid-2010.\n\n- INTEL HD Graphics 500 Series (Skylake) or newer\n- NVIDIA GeForce 400 Series (Fermi) or newer\n- AMD Radeon HD 7000 Series (GCN 1) or newer\n \nOlder graphics cards may also work (so long as they have up-to-date drivers for at least OpenGL 3.3 Core), but hardware requirements are subject to change in future releases.\n\nIf you encounter issues with Sodium, you should [make sure that your graphics drivers are up-to-date](https://help.minecraft.net/hc/en-us/articles/4409137348877-Minecraft-Java-Edition-Game-Crashes-and-Performance-Issues-FAQ#h_01FFNR5S1APTFHGR9K2W3JANZ4), as this is the most often the culprit of poor performance, crashes, and rendering bugs.\n\n## ⚙️ Technical details\n\nOf course, we can't just say that the game is magically faster without providing some kind of explanation. This list tries to cover some of the most significant changes which are responsible for performance improvements, but it's not complete or exhaustive of everything Sodium does.\n\n- A modern OpenGL rendering pipeline for chunk rendering that takes advantage of multi-draw techniques, allowing for a significant reduction in CPU overhead (~90%) when rendering the world. This can make a huge difference to frame rates for most computers that are not bottle-necked by the GPU or other components. Even if your GPU can't keep up, you'll experience much more stable frame times thanks to the CPU being able to work on other rendering tasks while it waits.\n\n- Vertex data for rendered chunks is made much more compact, allowing for video memory and bandwidth requirements to be cut by almost 40%.\n\n- Nearby block updates now take advantage of multi-threading, greatly reducing lag spikes caused by chunks needing to be updated. ([before](https://streamable.com/lm5sp5), [after](https://streamable.com/nsdl0r))\n\n- Chunk faces which are not visible (or facing away from the camera) are culled very early in the rendering process, eliminating a ton of geometry that would have to be processed on the GPU only to be immediately discarded. For integrated GPUs, this can greatly reduce memory bandwidth requirements and provide a modest speedup even when GPU-bound.\n\n- Plentiful optimizations for chunk loading and block rendering, making chunk loading significantly faster and less damaging to frame rates. ([before](https://streamable.com/3taw22), [after](https://streamable.com/4pesh2))\n\n- Many optimizations for vertex building and matrix transformations, speeding up block entity, mob, and item rendering significantly for when you get carried away placing too many chests in one room.\n\n- Many improvements to how the game manages memory and allocates objects, which in turn reduces memory consumption and lag spikes caused by garbage collector activity.\n\n- Many graphical fixes for smooth lighting effects, making the game run better while still applying a healthy amount of optimization. For example, take this [before and after](https://i.imgur.com/lYmlmgq.png) of a white concrete room in vanilla, or this [comparison while underwater](https://i.imgur.com/QQMuOTy.png).\n\n- Smooth lighting for fluids and other special blocks. ([comparison](https://i.imgur.com/z9HBcvq.png))\n\n- Smooth biome blending for blocks and fluids, providing greatly improved graphical quality that is significantly less computationally intensive.  ([comparison](https://i.imgur.com/Fud5oyF.png))\n\n- Animated textures which are not visible in the world are not updated, speeding up texture updating on most hardware (especially AMD cards.)\n\n... and much more, this list is still being written after the initial release.\n\n## 🐛 Reporting Issues\n\nPlease use the [issue tracker](https://github.com/jellysquid3/sodium-fabric/issues) linked at the top of the page to report bugs, crashes, and other issues.\n\n## ❓ Frequently Asked Questions\n\nWe have a short wiki with some of the most frequently asked questions [here](https://github.com/CaffeineMC/caffeine-meta/wiki/FAQ). More likely than not, your question already has an answer here.",
    "body_url": "https://cdn.modrinth.com/data/AANobbMI/description.md",
    "published": "2021-01-03T00:53:34.185936Z",
    "updated": "2022-03-02T00:43:35.806941Z",
    "status": "approved",
    "moderator_message": null,
    "license": {
        "id": "lgpl-3",
        "name": "GNU Lesser General Public License v3",
        "url": "https://cdn.modrinth.com/licenses/lgpl-3.txt"
    },
    "client_side": "required",
    "server_side": "unsupported",
    "downloads": 197249,
    "followers": 1497,
    "categories": [
        "optimization"
    ],
    "versions": [
        "6YGRDUVT",
        "1b0GhKHj",
        "80jYkEVr",
        "74Y5Z8fo",
        "5JyduDNN",
        "Fz37KqRh",
        "xuWxRZPd",
        "3JJvf9Kn",
        "YAGZ1cCS",
        "yaoBL9D9"
    ],
    "icon_url": "https://cdn.modrinth.com/data/AANobbMI/icon.png",
    "issues_url": "https://github.com/CaffeineMC/sodium-fabric/issues",
    "source_url": "https://github.com/CaffeineMC/sodium-fabric",
    "wiki_url": null,
    "discord_url": "https://jellysquid.me/discord",
    "donation_urls": [
        {
            "id": "ko-fi",
            "platform": "Ko-fi",
            "url": "https://ko-fi.com/jellysquid_"
        }
    ],
    "gallery": []
}