{
    "id": "AZomiSrC",
    "slug": "hydrogen",
    "project_type": "mod",
    "team": "lf83eMtM",
    "title": "Hydrogen",
    "description": "Reduces the memory usage of the game in more modded scenarios",
    "body": "## Status\n##### January 23rd, 2022\n\n**This repository has been archived** as we do not have the time or resources needed to maintain the project. No further updates will be published, and we won't be providing help for using it.\n\nIf you are looking for a replacement, consider taking a look at [FerriteCore](https://modrinth.com/mod/ferrite-core), as it generally offers more significant improvements to memory usage in modded scenarios and is currently available for the latest version of Minecraft. \n\n---\n\n![graph](https://i.imgur.com/h4CLxZ0.png)\n\n_Memory usage before and after installing Hydrogen into the popular [All of Fabric 3](https://www.curseforge.com/minecraft/modpacks/all-of-fabric-3) modpack._\n\n<br>\n\nHydrogen is a free and open-source mod designed to reduce the game's memory requirements by implementing more memory-efficient data structures and logic. It's primarily designed for more heavily modded scenarios, but can offer (small) improvements even in lightly modded or vanilla scenarios.\n\n<br>\n\nThe mod works on both the client and server, and doesn't require the mod to be installed on both sides. However, the benefits of running Hydrogen on the server are pretty small as of the moment.\n\n<br>\n\n\n## Features\n\n- Implements more compact data structures for block states and properties, reducing memory usage significantly when using mods that add lots of complex blocks\n\n- De-duplicates block model geometry, saving memory on the client when multi-part block models are used\n\n- Fixes a few leaks in chunk loading code that results in the NBT data on disk being kept in memory after a chunk has loaded\n\n- Simplifies and flattens block model predicates to reduce unnecessary chaining",
    "body_url": null,
    "published": "2021-01-17T21:23:01.030011Z",
    "updated": "2021-07-15T22:33:19.676422Z",
    "status": "approved",
    "moderator_message": null,
    "license": {
        "id": "lgpl-3",
        "name": "GNU Lesser General Public License v3",
        "url": "https://cdn.modrinth.com/licenses/lgpl-3.txt"
    },
    "client_side": "optional",
    "server_side": "optional",
    "downloads": 79952,
    "followers": 819,
    "categories": [
        "optimization"
    ],
    "versions": [
        "gqJWYgtD",
        "aOtQ7hz2",
        "nc84mXki"
    ],
    "icon_url": "https://cdn.modrinth.com/data/AZomiSrC/icon.png",
    "issues_url": "https://github.com/jellysquid3/hydrogen-fabric/issues",
    "source_url": "https://github.com/jellysquid3/hydrogen-fabric",
    "wiki_url": null,
    "discord_url": "https://jellysquid.me/discord",
    "donation_urls": [],
    "gallery": []
}