{
    "id": "r0v8vy1s",
    "slug": "alternate-current",
    "team": "ICk2lOk1",
    "title": "Alternate Current",
    "description": "An efficient and non-locational redstone dust implementation",
    "body": "Alternate Current is an efficient and non-locational redstone dust implementation. Its main focus lies in reducing the lag caused by redstone dust, by optimizing the power calculations and reducing the number of shape and block updates emitted. As a side effect of these changes the block update order of redstone dust networks is predictable and intuitive rather than locational and chaotic.\n\n### Performance\n\nMSPT contributions of redstone dust are up to 20 times lower with Alternate Current, all the while maintaining a high level of Vanilla parity. Its low number of code modifications make it minimally invasive, so it's an easy drop-in replacement for Vanilla redstone dust.\n\nWhen compared to other popular redstone optimizations, Alternate Current comes out on top:\n- [Lithium](https://modrinth.com/mod/lithium) is up to 10 times slower*.\n- [RedstoneWireTurbo](https://www.curseforge.com/minecraft/mc-mods/carpet) is up to 4 times slower.\n\nKeep in mind that all three mods are compatible with each other. Alternate Current in combination with Lithium will bring even greater performance than either mod on its own.\n\nCheck out the [GitHub page](https://github.com/SpaceWalkerRS/alternate-current/blob/main/src/main/java/alternate/current/redstone/WireHandler.java) for a detailed explanation of Alternate Current's improvements.\n\n*While Lithium can boast 100% Vanilla parity, Alternate Current cannot.\n\n## Why is redstone so laggy?\n\nThere are two main reasons why redstone is laggy: unnecessary updates and unnecessary calculations, both of which are caused by the fact that redstone dust updates recursively. A redstone wire can update its power level over half a dozen times before settling on the final value, doing expensive calculations and emitting copious amounts of shape and block updates each time. On top of that, many shape and block updates are completely redundant. \n\n## How does Alternate Current fix that?\n\nAlternate Current fixes these issues by doing power calculations of the entire network before updating the power levels. Each wire will check power from non-wire components just once and power from other wires just twice. Power sources within the network are identified, and the power is spread from there. This makes the calculations more efficient and the update order more intuitive. Shape and block updates are only emitted when the final power level is reached, and each wire emits no redundant updates.",
    "body_url": null,
    "published": "2021-04-05T18:22:08.996630Z",
    "updated": "2021-11-30T17:04:21.614146Z",
    "status": "approved",
    "license": {
        "id": "mit",
        "name": "MIT License",
        "url": "https://cdn.modrinth.com/licenses/mit.txt"
    },
    "client_side": "unsupported",
    "server_side": "required",
    "downloads": 2926,
    "followers": 69,
    "categories": [
        "technology",
        "utility"
    ],
    "versions": [
        "SelhWtQR",
        "30P7c8Sc",
        "WKuWL0Q8",
        "Wcg8QtlB",
        "abJdxoIH",
        "bNScuC9w",
        "3ruTu1x6",
        "cnm8f9GG",
        "eKThDBxV",
        "fIgfufLA",
        "gKNMWQFe",
        "oQMPKDPc",
        "oX2SAJg0",
        "oaPAZHeF",
        "qZQ7ath8",
        "rdScmQX2",
        "5OYFZNQb",
        "xCLalPdC",
        "z78WRI0B",
        "9F6atBKt",
        "9gqrSAbv",
        "9uewQm0i",
        "CSFStoYN",
        "Ca2crPBC",
        "DDiRJszQ",
        "DJXww2qt",
        "1ebDeupo",
        "GiAWvJK9",
        "JBS77Njn",
        "JZErTOBa",
        "LynxUXOP",
        "MbEV8ysu",
        "N3bxgXDH",
        "O3ymAMEH"
    ],
    "icon_url": "https://cdn.modrinth.com/data/r0v8vy1s/icon.png",
    "issues_url": "https://github.com/SpaceWalkerRS/alternate-current/issues",
    "source_url": "https://github.com/SpaceWalkerRS/alternate-current",
    "wiki_url": null,
    "discord_url": "https://discord.gg/EJC9zkX",
    "donation_urls": []
}